"use strict";

/*
   SchoolRegistationSystem

   Author: Rikki Tomiko Ehrhart
   Date:   04.22.24

   Filename: classlist.js

   =========
   This file as a list of courses that the user can access


*/


var courses =
[
   {
      id: "engl-1", 
      subject: "english",
      title: "ENGL-1301", 
      name: "English Composition I",
      description: "A study of the principles of composition with emphasis on language, the mechanics of writing, the types of discourse, and research and documentation.", 
      online: true,
      available: 20,
      registered: 19, 
      days: "Mon/Wed",
      start: 8,
      end: 10,
   },
   {
      id: "engl-2", 
      subject: "english",
      title: "ENGL-2307", 
      name: "Beginning Creative Writing",
      description: "Instruction in literary writing: prose, poetry, screenwriting and drama. Topics may vary. Possible markets for creative writing to be discussed.", 
      online: false,
      available: 20,
      registered: 3, 
      days: "Sun",
      start: 8,
      end: 12,
   },
   {
      id: "engl-3", 
      subject: "english",
      title: "ENGL-2322", 
      name: "British Literature I",
      description: "Survey of English literature from Anglo-Saxon times through the 18th Century.", 
      online: false,
      available: 20,
      registered: 20, 
      days: "Tue/Thu",
      start: 3,
      end: 5,
   },
   {
      id: "engl-4", 
      subject: "english",
      title: "ENGL-1302", 
      name: "English Composition II",
      description: "A continuation of English 1301 with emphasis on analysis of readings in prose fiction.", 
      online: true,
      available: 20,
      registered: 2, 
      days: "Tue/Thu",
      start: 10,
      end: 12,
   },
   {
      id: "engl-5", 
      subject: "english",
      title: "ENGL-2311", 
      name: "Technical and Business Writing",
      description: "Principles, techniques, and skills needed to conduct scientific, technical, or business writing. Instruction in the writing of reports, letters, and other exercises applicable to a wide range of disciplines and careers. Emphasis on clarity, conciseness, and accuracy of expression. Research techniques, information design, effective use of graphics, and preparation and presentation of oral reports will be covered. Students planning to transfer to a 4-year university should take ENGL 1301 and ENGL 1302 to satisfy Core Curriculum requirements for English Rhetoric/Composition.", 
      online: true,
      available: 20,
      registered: 15, 
      days: "Fri",
      start: 1,
      end: 5,
   },
   {
      id: "engl-6", 
      subject: "english",
      title: "ENGL-2323", 
      name: "British Literature II",
      description: "Survey of English literature from the late 18th Century to the present.", 
      online: false,
      available: 20,
      registered: 1, 
      days: "Mon/Wed",
      start: 1,
      end: 3,
   },
   {
      id: "math-1", 
      subject: "math",
      title: "MATH-1314", 
      name: "College Algebra",
      description: "In-depth study and applications of polynomial, rational, radical, exponential and logarithmic functions, and systems of equations using matrices. This course does not meet the prerequisite for Precalculus (MATH 2412). MATH-1314 and MATH-1414 may not both be used in a degree plan for graduation purposes, or to meet graduation requirements.", 
      online: true,
      available: 20,
      registered: 20, 
      days: "Tue/Thu",
      start: 1,
      end: 3,
   },
   {
      id: "math-2", 
      subject: "math",
      title: "MATH-1325", 
      name: "Business Calculus",
      description: "Course treating standard one-variable calculus and its applications for business students, as well as selected other business applications. Calculus topics include the derivative, methods of finding derivatives, applications of derivatives, the integral, methods of integration, applications of integration, and the calculus of the exponential and logarithmic functions.", 
      online: false,
      available: 20,
      registered: 13, 
      days: "Sat",
      start: 1,
      end: 5,
   },
   {
      id: "math-3", 
      subject: "math",
      title: "MATH-1332", 
      name: "Contemporary Math",
      description: "A topics-based course, with a variety of possible topics chosen by individual instructors. The selected topics may include: sets, logic, number theory, geometry, probability and statistics, and the mathematics of finance and social choice. This course is not algebra-intensive, and is designed for non-technical majors.", 
      online: false,
      available: 20,
      registered: 19, 
      days: "Mon/Wed",
      start: 10,
      end: 12,
   },
   {
      id: "math-4", 
      subject: "math",
      title: "MATH-1342", 
      name: "Elementary Statistics",
      description: "A first course in statistics for students in business; nursing; allied health; or the social, physical, or behavioral sciences; or for any student requiring knowledge of the fundamental procedures for data organization and analysis.", 
      online: true,
      available: 20,
      registered: 1, 
      days: "Sun",
      start: 8,
      end: 12,
   },
   {
      id: "math-5", 
      subject: "math",
      title: "MATH-1414", 
      name: "College Alegbra for PreCalculus",
      description: "A course for students planning to take Precalculus (MATH 2412) and Calculus (MATH 2413). Content includes the rational, real, and complex number systems; the study of functions including polynomial, rational, radical, exponential, and logarithmic functions and related equations; inequalities; sequences and series; systems of linear equations using matrices.", 
      online: true,
      available: 20,
      registered: 6, 
      days: "Mon/Wed",
      start: 3,
      end: 5,
   },
   {
      id: "math-6", 
      subject: "math",
      title: "MATH-2412", 
      name: "PreCalculus",
      description: "A course designed to prepare students for Calculus I (MATH 2413). Content includes the study of algebraic, rational, logarithmic, exponential, and trigonometric functions, graphs, equations, and applications; trigonometric identities; parametric equations; conic sections; vectors; the polar coordinate system.", 
      online: false,
      available: 20,
      registered: 14, 
      days: "Tue/Thu",
      start: 8,
      end: 10,
   },
   {
      id: "scie-1", 
      subject: "science",
      title: "CHEM-1105", 
      name: "Introduction to Chemistry + Lab",
      description: "The course is the laboratory to accompany CHEM 1305 lecture. Emphasis is placed on techniques, properties and reactions, and reinforcing principles offered in the lecture portion of the course.", 
      online: false,
      available: 20,
      registered: 14, 
      days: "Mon/Wed",
      start: 1,
      end: 3,
   },
   {
      id: "scie-2", 
      subject: "science",
      title: "CHEM-2123", 
      name: "Organic Chemistry + Lab",
      description: "The course is the laboratory to accompany CHEM 2323 lecture. Emphasis is placed on techniques, properties and reactions, and reinforcing principles offered in the lecture portion of the course.", 
      online: false,
      available: 20,
      registered: 19, 
      days: "Tue/Thu",
      start: 3,
      end: 5,
   },
   {
      id: "scie-3", 
      subject: "science",
      title: "ENGR-1201", 
      name: "Introduction to Engineering",
      description: "Introduction to engineering as a discipline and profession. Includes instruction in the application of mathematical and scientific principles to the solution of practical problems. A broad range of problems will be considered in order to introduce the student to various engineering majors and careers.", 
      online: true,
      available: 20,
      registered: 20, 
      days: "Sat",
      start: 8,
      end: 12,
   },
   {
      id: "scie-4", 
      subject: "science",
      title: "ENGR-2301", 
      name: "Statistics",
      description: "Calculus-based study of the composition and resolution of forces. Vector algebra, force systems, free body diagrams; equilibrium of rigid bodies and structures; centroids, distributed loads, friction; moment of inertia.", 
      online: true,
      available: 20,
      registered: 16, 
      days: "Tue/Thu",
      start: 10,
      end: 12,
   },
   {
      id: "scie-5", 
      subject: "science",
      title: "COSC-1336", 
      name: "Programming Fundamentals I",
      description: "Introduces the fundamental concepts of structured programming. Topics include software development methodology, data types, control structures, functions, arrays, and the mechanics of running, testing, and debugging. This course assumes computer literacy. This course requires the same math skills necessary for College Algebra.", 
      online: true,
      available: 20,
      registered: 3, 
      days: "Mon/Wed",
      start: 8,
      end: 10,
   },
   {
      id: "scie-6", 
      subject: "science",
      title: "COSC-3360", 
      name: "Computer Ethics",
      description: "Examine personal and contemporary organizational ethical issues and challenges in the design, development, and use of computing technologies in a global environment. Special emphasis on philosophical basis for computer ethics, reliability and safety of computer systems, protecting software and other intellectual property, computer crime and legal issues, and professional codes of ethics.", 
      online: false,
      available: 20,
      registered: 11, 
      days: "Fri",
      start: 1,
      end: 5,
   },
   {
      id: "hist-1", 
      subject: "history",
      title: "HIST-1301", 
      name: "US History I",
      description: "A study of the history of the United States to 1877.", 
      online: false,
      available: 20,
      registered: 12, 
      days: "Fri",
      start: 8,
      end: 12,
   },
   {
      id: "hist-2", 
      subject: "history",
      title: "HIST-1302", 
      name: "US History II",
      description: "A study of the history of the United States from 1877 to present.", 
      online: false,
      available: 20,
      registered: 20, 
      days: "Tue/Thu",
      start: 8,
      end: 10,
   },
   {
      id: "hist-3", 
      subject: "history",
      title: "HIST-2311", 
      name: "Western Civilization I",
      description: "Development of ancient, medieval, and early modern civilizations to 1660.", 
      online: true,
      available: 20,
      registered: 19,
      days: "Mon/Wed",
      start: 3,
      end: 5, 
   },
   {
      id: "hist-4", 
      subject: "history",
      title: "HIST-2312", 
      name: "Western Civilization II",
      description: "Development of modern western civilization from 1660 to present.", 
      online: true,
      available: 20,
      registered: 12, 
      days: "Mon/Wed",
      start: 8,
      end: 12,
   },
   {
      id: "hist-5", 
      subject: "history",
      title: "HIST-2321", 
      name: "World Civilization I",
      description: "A survey of the social, political, economic, cultural, religious, and intellectual history of the world from the emergence of human cultures through the 15th century. The course examines major cultural regions of the world in Africa, the Americas, Asia, Europe, and Oceania and their global interactions over time. Themes include the emergence of early societies, the rise of civilizations, the development of political and legal systems, religion and philosophy, economic systems and trans-regional networks of exchange.", 
      online: true,
      available: 20,
      registered: 5, 
      days: "Sat",
      start: 1,
      end: 5,
   },
   {
      id: "hist-6", 
      subject: "history",
      title: "HIST-2327", 
      name: "Mexican American History I",
      description: "A study of the economic, social, cultural, and political development of Mexican American people with particular emphasis upon their contribution to American society. Counts toward U.S. History requirement or as an elective.", 
      online: false,
      available: 20,
      registered: 9, 
      days: "Tue/Thu",
      start: 1,
      end: 3,
   },
   {
      id: "arts-1", 
      subject: "arts",
      title: "ARTS-1301", 
      name: "Art Appreciation",
      description: "A general introduction to the visual arts designed to create an appreciation of the vocabulary, media, techniques, and purposes of the creative process. Students will critically interpret and evaluate works of art within formal, cultural, and historical contexts. ", 
      online: false,
      available: 20,
      registered: 19, 
      days: "Sun",
      start: 1,
      end: 5,
   },
   {
      id: "arts-2", 
      subject: "arts",
      title: "ARTS-1303", 
      name: "Art History I",
      description: "A chronological analysis of the historical and cultural contexts of the visual arts from prehistoric times to the14th century. Note: A chronological analysis of the historical and cultural contexts of the visual arts from prehistoric times to the 14th century.", 
      online: true,
      available: 20,
      registered: 20, 
      days: "Mon/Wed",
      start: 10,
      end: 12,
   },
   {
      id: "arts-3", 
      subject: "arts",
      title: "DRAM-1351", 
      name: "Acting I",
      description: "Basic skills and techniques of acting, including increased sensory awareness, ensemble and solo performing, character analysis, and script analysis. Development of stage presence and characterizations through improvisations and scenes. Technical lab hours required.", 
      online: false,
      available: 20,
      registered: 12, 
      days: "Tue/Thu",
      start: 1,
      end: 3,
   },
   {
      id: "arts-4", 
      subject: "arts",
      title: "DRAM-2355", 
      name: "Script Analysis",
      description: "Examination of foundational skills for understanding the structure and content of play scripts for interpretation and conceptualization in theater productions by directors, designers, actors, and technicians. Introduces students to significant plays in the history of dramatic literature in the playwright's social and cultural context.", 
      online: true,
      available: 20,
      registered: 8, 
      days: "Tue/Thu",
      start: 8,
      end: 10,
   },
   {
      id: "arts-5", 
      subject: "arts",
      title: "MUSI-1161", 
      name: "IPA for Singers",
      description: "A study of the International Phonetic Alphabet (IPA) and its application to singing in English, Italian, German, and French.", 
      online: true,
      available: 20,
      registered: 17, 
      days: "Sat",
      start: 8,
      end: 12,
   },
   {
      id: "arts-6", 
      subject: "arts",
      title: "MUSI-1181", 
      name: "Piano I",
      description: "Group instruction in the fundamentals of keyboard technique for beginning piano students. Note: This class is designed for beginning piano students.", 
      online: false,
      available: 20,
      registered: 6, 
      days: "Mon/Wed",
      start: 3,
      end: 5,
   },
   {
      id: "phed-1", 
      subject: "pe",
      title: "KINE-1101", 
      name: "Cardio Conditioning",
      description: "This course includes a variety of exercises focusing on increasing cardio-respiratory endurance as well as improving muscular strength, muscular endurance, flexibility and body composition. Movements set to music may include interval and circuit training, high and/or low impact movements, body sculpting, slide, cardio-dance, step aerobics and boot-camp style training.", 
      online: true,
      available: 20,
      registered: 4, 
      days: "Sun",
      start: 1,
      end: 5,
   },
   {
      id: "phed-2", 
      subject: "pe",
      title: "KINE-1105", 
      name: "Basketball",
      description: "Instruction for all levels of skill in the fundamentals of basketball. Emphasis upon the development and improvement of total fitness, skill and general knowledge about basketball for leisure time use.", 
      online: false,
      available: 20,
      registered: 10, 
      days: "Mon/Wed",
      start: 1,
      end: 3,
   },
   {
      id: "phed-3", 
      subject: "pe",
      title: "KINE-1351", 
      name: "BOWLING",
      description: "Fundamentals of bowling skills, strategies and scoring. For beginning and intermediate skill levels.", 
      online: false,
      available: 20,
      registered: 12, 
      days: "Tue/Thu",
      start: 3,
      end: 5,
   },
   {
      id: "phed-4", 
      subject: "pe",
      title: "KINE-1107", 
      name: "Strethcing/Flexibility",
      description: "A physical-conditioning course that emphasizes correct techniques for improving flexibility with individual and partner stretches from athletics, dance and yoga. May include Pilates matwork and balance ball exercises.", 
      online: true,
      available: 20,
      registered: 20, 
      days: "Fri",
      start: 8,
      end: 12,
   },
   {
      id: "phed-5", 
      subject: "pe",
      title: "KINE-1108", 
      name: "Walking/Jogging",
      description: "A physical conditioning course that emphasizes cardiovascular fitness through your choice of walking, jogging, or a combination of both. Students will not be required to run. Correct techniques in striding and form will be introduced in addition to discussion of the benefits of aerobic exercise, nutrition, weight management, and associated topics.", 
      online: true,
      available: 20,
      registered: 17, 
      days: "Mon/Wed",
      start: 10,
      end: 12,
   },
   {
      id: "phed-6", 
      subject: "pe",
      title: "KINE-1113", 
      name: "Dance-Jazz I",
      description: "An introductory course designed for the student with little or no previous training. Primary emphasis on jazz technique; placement and alignment of the body, footwork, stretches musicality, and other preparatory work necessary for the establishment of a basic foundation. Different styles of jazz dance such as musical theatre, television, and movie styles are explored.", 
      online: false,
      available: 20,
      registered: 19, 
      days: "Tue/Thu",
      start: 10,
      end: 12,
   }
]